"""Вычисляет полупериметр треугольника, складывая длины его трёх сторон и деля результат на 2.

Параметры:

a, b, c: три значения, представляющие длины сторон треугольника.
Возвращаемое значение:

Полупериметр треугольника, полученный путём деления суммы длин трёх сторон на 2."""
def area(a, b, c):
    return (a + b + c) / 2

"""Вычисляет периметр треугольника, складывая длины его трёх сторон.

Параметры:

a, b, c: три значения, представляющие длины сторон треугольника.
Возвращаемое значение:

Периметр треугольника, который равен сумме длин всех трёх сторон."""
def perimeter(a, b, c):
    return a + b + c
